СкладГП/src/InformationRegisters/ОшибкиКОтправке/ОшибкиКОтправке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиКОтправке</name>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/CommonModules/Ошибки/Module.bsl
Процедура Отложить(ТекстОшибки) Экспорт
	МЗ = РегистрыСведений.ОшибкиКОтправке.СоздатьМенеджерЗаписи();
	МЗ.ДатаВремя = ТекущаяДатаСеанса();
	МЗ.Ошибка = ТекстОшибки;
	МЗ.Записать(ИСТИНА);
КонецПроцедуры  

Процедура ОтправитьПервуюОтложенную(ИдентификаторПользователяОповещениеОшибка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОшибкиКОтправке.ДатаВремя КАК ДатаВремя,
	|	ОшибкиКОтправке.Ошибка КАК Ошибка
	|ИЗ
	|	РегистрСведений.ОшибкиКОтправке КАК ОшибкиКОтправке
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВремя";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отправлено = telegram.ОтправитьСообщениеВТелегу(ИдентификаторПользователяОповещениеОшибка, Выборка.Ошибка, ЛОЖЬ);
		Если Отправлено Тогда
			МЗ = РегистрыСведений.ОшибкиКОтправке.СоздатьМенеджерЗаписи();
			МЗ.ДатаВремя = ТекущаяДатаСеанса();
			МЗ.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
